import swisseph as swe
import datetime as dt  # use alias to avoid confusion
import datetime
# Rasi dictionary
rasi_month = {
    1: "மேஷம் (Aries)",
    2: "ரிஷபம் (Taurus)",
    3: "மிதுனம் (Gemini)",
    4: "கடகம் (Cancer)",
    5: "சிம்மம் (Leo)",
    6: "கன்னி (Virgo)",
    7: "துலாம் (Libra)",
    8: "விருச்சிகம் (Scorpio)",
    9: "தனுசு (Sagittarius)",
    10: "மகரம் (Capricorn)",
    11: "கும்பம் (Aquarius)",
    12: "மீனம் (Pisces)"
}

graha_dict = {
    0: "சூரியன் (Sun)",
    1: "சந்திரன் (Moon)",
    2: "செவ்வாய் (Mars)",
    3: "புதன் (Mercury)",
    4: "குரு (Jupiter)",
    5: "சுக்கிரன் (Venus)",
    6: "சனி (Saturn)",
    7: "ராகு (Rahu)",
    8: "கேது (Ketu)"
}

graha_to_nakshatra_lord = {
    "கேது": "Ketu",
    "சுக்கிரன்": "Venus",
    "சூரியன்": "Sun",
    "சந்திரன்": "Moon",
    "செவ்வாய்": "Mars",
    "ராகு": "Rahu",
    "குரு": "Jupiter",
    "சனி": "Saturn",
    "புதன்": "Mercury"
}
tithi_dict = {
    1: "பிரதமை",
    2: "த்விதியை",
    3: "த்ரிதியை",
    4: "சதுர்த்தி",
    5: "பஞ்சமி",
    6: "ஷஷ்டி",
    7: "ஸப்தமி",
    8: "அஷ்டமி",
    9: "நவமி",
    10: "தசமி",
    11: "ஏகாதசி",
    12: "துவாதசி",
    13: "த்ரயோதசி",
    14: "சதுர்த்தசி",
    15: "பௌர்ணமி / அமாவாசை"
}
yoga_dict = [
    "விஷ்கும்பம்", "ப்ரீதி", "ஆயுஷ்மான்", "சௌபாக்யம்", "சோபனம்", "அதிகண்டம்",
    "சுக்கிரம்", "பிரமம்", "ஐந்திரம்", "வைத்த்ருதி", "வயன்", "விஷ்டி",
    "சர்வம்", " சித்தம் ", "ஸாத்யம்", "ஸுபம்", "சுகர்மா", "த்ருதி",
    "பூஷ்யம்", "வயிஜயம்", "சித்திரை", "ஸ்ரீவன்", "ஸத்சிதம்", "விஷ்ணு",
    "ஆயுஷ்மான்", "வைத்த்ருதி", "ப்ரீதி"
]
karana_list = [
    "பாலவம்", "கௌலவம்", "தைதுலம்", "கர்ஜை",
    "வனிஜை", "விஷ்டி (பத்ரை)", "சகுனி",
    "சதுஷ்பாத்", "நாகவம்", "கிம்ஸ்துக்னம்"
]
weekday_dict = {
    0: "திங்கட் கிழமை",
    1: "செவ்வாய்",
    2: "புதன்",
    3: "வியாழன்",
    4: "வெள்ளி",
    5: "சனி",
    6: "ஞாயிறு"
}

tamil_months = {
    1: "சித்திரை",
    2: "வைகாசி",
    3: "ஆனி",
    4: "ஆடி",
    5: "ஆவணி",
    6: "புரட்டாசி",
    7: "ஐப்பசி",
    8: "கார்த்திகை",
    9: "மார்கழி",
    10: "தை",
    11: "மாசி",
    12: "பங்குனி"
}

weekday_lords = {
    "ஞாயிறு": "சூரியன்",
    "திங்கட் கிழமை": "சந்திரன்",
    "செவ்வாய்": "செவ்வாய்",
    "புதன்": "புதன்",
    "வியாழன்": "குரு",
    "வெள்ளி": "சுக்கிரன்",
    "சனி": "சனி"
}

rasi_lords = {
    1: "செவ்வாய்",
    2: "சுக்கிரன்",
    3: "புதன்",
    4: "சந்திரன்",
    5: "சூரியன்",
    6: "புதன்",
    7: "சுக்கிரன்",
    8: "செவ்வாய்",
    9: "குரு",
    10: "சனி",
    11: "சனி",
    12: "குரு"
}

navamsa_lords = {
    1:  "செவ்வாய்",
    2:  "ரிஷபம்–சுக்கிரன்",
    3:  "மிதுனம்–புதன்",
    4:  "சிம்மம்–சூரியன்",
    5:  "கன்னி–புதன்",
    6:  "துலாம்–சுக்கிரன்",
    7:  "விருச்சிகம்–செவ்வாய்",
    8:  "தனுசு–குரு",
    9:  "மகரம்–சனி"
}


nakshatra_dict = {
    1:  ("அசுவினி", "Ashwini", "Ketu"),
    2:  ("பரணி", "Bharani", "Venus"),
    3:  ("கிருத்திகை", "Krittika", "Sun"),
    4:  ("ரோஹிணி", "Rohini", "Moon"),
    5:  ("மிருகசீரிடம்", "Mrigashira", "Mars"),
    6:  ("திருவாதிரை", "Ardra", "Rahu"),
    7:  ("புனர்பூசம்", "Punarvasu", "Jupiter"),
    8:  ("பூசம்", "Pushya", "Saturn"),
    9:  ("ஆயில்யம்", "Ashlesha", "Mercury"),
    10: ("மகம்", "Magha", "Ketu"),
    11: ("பூரம்", "Purva Phalguni", "Venus"),
    12: ("உத்திரம்", "Uttara Phalguni", "Sun"),
    13: ("அஸ்தம்", "Hasta", "Moon"),
    14: ("சித்திரை", "Chitra", "Mars"),
    15: ("சுவாதி", "Swati", "Rahu"),
    16: ("விசாகம்", "Vishakha", "Jupiter"),
    17: ("அனுஷம்", "Anuradha", "Saturn"),
    18: ("கேட்டை", "Jyeshtha", "Mercury"),
    19: ("மூலம்", "Mula", "Ketu"),
    20: ("பூராடம்", "Purva Ashadha", "Venus"),
    21: ("உத்திராடம்", "Uttara Ashadha", "Sun"),
    22: ("திருவோணம்", "Shravana", "Moon"),
    23: ("அவிட்டம்", "Dhanishta", "Mars"),
    24: ("சதயம்", "Shatabhisha", "Rahu"),
    25: ("பூரட்டாதி", "Purva Bhadrapada", "Jupiter"),
    26: ("உத்திரட்டாதி", "Uttara Bhadrapada", "Saturn"),
    27: ("ரேவதி", "Revati", "Mercury")
}
